4dogs_dalvik/doc/D2.org
#+TITLE: Aprotector文档格式
#+AUTHOR: 四维创智
#+DATE:13/6/2013

* 代码注释规格
  1.分析完每个变量，函数都进行注释

  2.如果其中有E文注释保留，然后在随后进行自己的注释

  3.注释中一定要有函数的功能描述

* 源文件功能介绍文档
** 内容
   1.每个人的目录名为文档介绍的名称

   2.单个源文件使用"vm_"做为前缀后跟源文件名作为文档的名称

   3.每个源文件的具体功能

   4.如果一个源文件分析完成，要有标记

   5.文档中拥有两种标签一种是内容标签，一种是源文件标签

   6.内容标签使用[]号定义，标题可以随意填写，其标签以下是其内容

   7.源代码标签在未完成分析之前使用<>括住源文件名称，当分析完毕后用[]括住源文件名称

** 编码格式
	最终的文档必须以UTF-8编码进行保存

** 文档格式
	[整体介绍]

	内容...

	[xxx]
	
	内容...

	[yyy]

	内容...

	[源文件1]

	内容...

	<源文件2>

	内容还没有完全分析完毕...

** 文件名实例
   例如，做alloc目录里的分析。只要取目录名称alloc.txt即可，直接把此文件放置到文档目录(doc)的根目录即可。

   例如，做AllocTracker.cpp。要是用vm_AllocTracker.txt作为文档名称。

** 格式转换
   使用enca file确定编码形式

   使用iconv -f XXX -t UTF-8 -o file.new file.old 来转换编码

   使用iconv -l 可以列出当前iconv可以转换的编码

   
