4dogs_dalvik/doc/D2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Aprotector文档格式</title>
<!-- 2013-07-18 四 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="四维创智"/>
</head>
<body>
<div id="content">
<h1 class="title">Aprotector文档格式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 代码注释规格</a></li>
<li><a href="#sec-2">2. 源文件功能介绍文档</a>
<ul>
<li><a href="#sec-2-1">2.1. 内容</a></li>
<li><a href="#sec-2-2">2.2. 编码格式</a></li>
<li><a href="#sec-2-3">2.3. 文档格式</a></li>
<li><a href="#sec-2-4">2.4. 文件名实例</a></li>
<li><a href="#sec-2-5">2.5. 格式转换</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 代码注释规格</h2>
<div class="outline-text-2" id="text-1">
<p>
1.分析完每个变量，函数都进行注释
</p>

<p>
2.如果其中有E文注释保留，然后在随后进行自己的注释
</p>

<p>
3.注释中一定要有函数的功能描述
</p>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 源文件功能介绍文档</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 内容</h3>
<div class="outline-text-3" id="text-2-1">
<p>
1.每个人的目录名为文档介绍的名称
</p>

<p>
2.单个源文件使用"vm_"做为前缀后跟源文件名作为文档的名称
</p>

<p>
3.每个源文件的具体功能
</p>

<p>
4.如果一个源文件分析完成，要有标记
</p>

<p>
5.文档中拥有两种标签一种是内容标签，一种是源文件标签
</p>

<p>
6.内容标签使用[]号定义，标题可以随意填写，其标签以下是其内容
</p>

<p>
7.源代码标签在未完成分析之前使用&lt;&gt;括住源文件名称，当分析完毕后用[]括住源文件名称
</p>
</div>
</div>
<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 编码格式</h3>
<div class="outline-text-3" id="text-2-2">
<p>
最终的文档必须以UTF-8编码进行保存
</p>
</div>
</div>
<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 文档格式</h3>
<div class="outline-text-3" id="text-2-3">
<p>
[整体介绍]
</p>

<p>
内容&#x2026;
</p>

<p>
[xxx]
</p>

<p>
内容&#x2026;
</p>

<p>
[yyy]
</p>

<p>
内容&#x2026;
</p>

<p>
[源文件1]
</p>

<p>
内容&#x2026;
</p>

<p>
&lt;源文件2&gt;
</p>

<p>
内容还没有完全分析完毕&#x2026;
</p>
</div>
</div>
<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 文件名实例</h3>
<div class="outline-text-3" id="text-2-4">
<p>
例如，做alloc目录里的分析。只要取目录名称alloc.txt即可，直接把此文件放置到文档目录(doc)的根目录即可。
</p>

<p>
例如，做AllocTracker.cpp。要是用vm<sub>AllocTracker</sub>.txt作为文档名称。
</p>
</div>
</div>
<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 格式转换</h3>
<div class="outline-text-3" id="text-2-5">
<p>
使用enca file确定编码形式
</p>

<p>
使用iconv -f XXX -t UTF-8 -o file.new file.old 来转换编码
</p>

<p>
使用iconv -l 可以列出当前iconv可以转换的编码
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 13/6/2013</p>
<p class="author">Author: 四维创智</p>
<p class="date">Created: 2013-07-18 四 11:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0-pre)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
